{
  "_id": "~3465336",
  "createdBy": "joseliyo_jstnk@example.org",
  "updatedBy": "joseliyo_jstnk@example.org",
  "createdAt": 1644273269996,
  "updatedAt": 1644279719145,
  "_type": "caseTemplate",
  "name": "Targeted Threat Intelligence (TTI) #3 - Analysis",
  "displayName": "Targeted Threat Intelligence (TTI) #3 - Analysis",
  "titlePrefix": "[TTI]",
  "description": "| Phase | Step | Outcome |\n| ------------- |:-------------:| -----:|\n| Targeted Threat Intelligence | 3 of 5 | Collect, analyze and disseminate threats that can do malicious activities against the `Entity` and create a threat modeling to elaborate later scenarios of attacks. Threat modeling can help after the TIBER exercise to prioritize security efforts |\n\n# Tasks\n\n- `Task #1 - Target`\n- `Task #2 - Threat`\n- `Task #3 - Threat Modeling`\n\n# Analysis\n\nDuring this activity of the Targeted Threat Intelligence phase, the work will be divided into two key parts.\n\n1. Target\n2. Threats\n\n# Target\n\nThe first goal is form a detailed preliminary picture of the entity from the actor's perspective. A digital footprint is a good approach to run this task. All the information gathered during the target activity will be used in the threat task.\n\n# Threat\n\nThe goal here is form a threat modeling about actors, their TTPs  and create scenarios afterwards with that. **All the information MUST be mapped with the information obtained in the target task**. It is important, since this approach can help us to focus on what matters\n\n# Outcome\n\nThe outcome of this case is:\n- Information gathered with the actor's perspective\n- Identification of critical systems\n- Threat Modeling\n- Actors mapped to ATT&CK\n- Procedures made by the actors",
  "severity": 2,
  "tags": ["TTI", "TI", "TIBER"],
  "flag": false,
  "tlp": 2,
  "pap": 2,
  "tasks": [
    {
      "id": "~3342336",
      "_id": "~3342336",
      "createdBy": "joseliyo_jstnk@example.org",
      "createdAt": 1644279719138,
      "_type": "case_task",
      "title": "Task #2 - Threat",
      "group": "CTI Tactical Analyst & CTI Operational Analyst",
      "description": "# Dependencies\n\nThis task has dependency on `Task #1 - Target`\n\n# Goal\n\nYour goal is to map information to later create a threat modeling about actors, their TTPs and help to create scenarios in the following cases.\n\n- **Uderstand motivations and objectives**. After get information about the landscape of the `Entity`... What motivations could the actors have to carry out an attack against the `Entity`?\n  - Financial objectives?\n  - Espionage motivations?\n  - Ideology motivations?\n  - Geopolitical motivations?\n- **Use ATT&CK MITRE for tactics and techniques**. Use the MITRE Framework to map all the tactics and techniques used by those actors idenfitied in the previous step. Is recommended use MITRE ATT&CK Navigator to create a layer of all the techniques used (https://mitre-attack.github.io/attack-navigator/).\n- **Collect different procedures to test**. Get all the tactics and techniques is well. But get besides the procedures it's much better. **Is really important** get the procedures, since these will be used by the RT to simulate the behaviors.",
      "status": "Waiting",
      "flag": false,
      "order": 1
    },
    {
      "id": "~3448928",
      "_id": "~3448928",
      "createdBy": "joseliyo_jstnk@example.org",
      "createdAt": 1644279719136,
      "_type": "case_task",
      "title": "Task #1 - Target",
      "group": "CTI Tactical Analyst & CTI Operational Analyst",
      "description": "# Dependencies\n\nThis task has dependency on `Case #2 - Sharing Intelligence`\n\n# Goal\n\nYour goal is create a detailed preliminary picture of the `Entity` from the actor's perspective. To achieve it, some of the steps that you need to do are the following.\n\n- **Search for attack surface**. Let's think like an adversary. What can they see by searching for the entity from the outside? Use different technology like Google Hacking, Shodan queries, reconnaissance tools, etc. The information gathered here will be used by the RT.\n- **Search for people, process and technology**. Similar to the above. Which people work for the `Entity`? Look for information about employees, leaked information, exposed technology with possible vulnerabilities, business processes, etc. Think that information about employees could be used as an entry vector using spearphishing and information about technology with vulnerabilities could be used as an entry vector using exploitation of exposed applications\n- **Search for critical systems**. The identification of servers or applications that could paralyze the business are points of interest for the actors.\n\n**Some interesting questions made by TIBER:**\n\n- What personnel could be targeted by threat actors based on the job roles and assumed levels of privileged access to key technologies or CFs?\n- What contact details and credentials belonging to key personnel can be found that could assist threat actors in their attacks?\n- What are the most prevalent and/or critical vulnerabilities for the sector that are likely to be present at the entity?\n- Which components of the network infrastructure of the entity have been targeted by selected threat actors before?\n- What information about the systems underpinning the CFs is available that reveal potential vulnerabilities that could be exploited by actors?\n- Which of the entity’s third party/managed service providers have been compromised before and how could this provide opportunities for actors to compromise the entity?\n- Which of the entity’s third party/managed service providers could be compromised and how could this provide opportunities for actors to compromise the entity?",
      "status": "Waiting",
      "flag": false,
      "order": 0
    },
    {
      "id": "~3481608",
      "_id": "~3481608",
      "createdBy": "joseliyo_jstnk@example.org",
      "createdAt": 1644279719143,
      "_type": "case_task",
      "title": "Task #3 - Threat Modeling",
      "group": "CTI Tactical Analyst & CTI Operational Analyst",
      "description": "# Dependencies\n\nThis task has dependency on `Task #1 - Target` and `Task #2 - Threat`\n\n# Goal\n\nYour goal is create a threat modeling. Once you have all the information previously analyzed, is time to disseminate it. The best way for do it is creating a threat modeling of the `Entity`.\n\nAsk yourself the following question:\n\n> Why do you map procedures against Windows Server if the `Entity` doesn't have?\n\nThat question can help us to understand what's matters, prioritizing our efforts on what is probable rather than theoretically possible.\n\nStart the threat modeling from up to down mapping the following information:\n- Entity\n- Critical Functions\n- Motivations\n- Actors\n- Events and capabilities\n- Tactics\n- Techniques\n- Procedures\n\nIf you want to follow a guide to create it, you can see the following blog, where is detailed step by step how to create a threat model: https://jstnk9.github.io/jstnk9/blog/Threat-modeling-and-strategic-vision-of-risks\n",
      "status": "Waiting",
      "flag": false,
      "order": 2
    }
  ],
  "status": "Ok",
  "customFields": {},
  "metrics": {}
}
